NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lc10a/nrf54lc10a_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_UICR_S</name>
      <description>User Information Configuration Registers</description>
      <baseAddress>0x00FFD000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>APPROTECT[%s]</name>
          <description>Access Port Protection Registers</description>
          <headerStructName>UICR_APPROTECT</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>PROTECT0</name>
            <description>Description cluster: Access port protection</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.DOMAIN DBGEN and NIDEN signal protectors unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROTECT1</name>
            <description>Description cluster: Access port protection</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.DOMAIN DBGEN and NIDEN signal protectors unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>SECUREAPPROTECT[%s]</name>
          <description>Access Port Protection Registers</description>
          <headerStructName>UICR_SECUREAPPROTECT</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x020</addressOffset>
          <register>
            <name>PROTECT0</name>
            <description>Description cluster: Access port protection</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.DOMAIN SPIDEN and SPNIDEN signal protectors unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROTECT1</name>
            <description>Description cluster: Access port protection register</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.DOMAIN SPIDEN and SPNIDEN signal protectors unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>AUXAPPROTECT[%s]</name>
          <description>Access Port Protection Registers</description>
          <headerStructName>UICR_AUXAPPROTECT</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x040</addressOffset>
          <register>
            <name>PROTECT0</name>
            <description>Description cluster: Access port protection</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.AP DBGEN signal protector unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROTECT1</name>
            <description>Description cluster: Access port protection register</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unprotected</name>
                    <description>Leaves TAMPC PROTECT.AP DBGEN signal protector unlocked and under CPU control.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>ERASEPROTECT[%s]</name>
          <description>Erase Protection Registers</description>
          <headerStructName>UICR_ERASEPROTECT</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x60</addressOffset>
          <register>
            <name>PROTECT0</name>
            <description>Description cluster: Erase protection</description>
            <addressOffset>0x0</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Protected</name>
                    <description>Erase protection is enabled and the signal protector is locked.</description>
                    <value>0x50FA50FA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROTECT1</name>
            <description>Description cluster: Erase protection</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PALL</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Protected</name>
                    <description>Erase protection is enabled and the signal protector is locked.</description>
                    <value>0x50FA50FA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>BOOTCONF</name>
          <description>Immutable boot region configuration.</description>
          <addressOffset>0x080</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ</name>
              <description>Read access. Must be enabled in order for the Arm Cortex CPU to start executing from RRAM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Reading from the region is not allowed.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Reading from the region is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITE</name>
              <description>Write access</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Writing to the region is not allowed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Writing to the region is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXECUTE</name>
              <description>Execute access</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Executing code from the region is not allowed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Executing code from the region is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECURE</name>
              <description>Secure access</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NonSecure</name>
                  <description>Both secure and non-secure access to region is allowed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>Only secure access to region is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEONCE</name>
              <description>Write-once</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Write-once disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write-once enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Enable lock of configuration register</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock is disabled, and the RRAMC region configuration registers for the
                    immutable boot region are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock is enabled, and the RRAMC configuration registers for the
                    immutable boot region are read-only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Immutable boot region size</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>USER</name>
          <description>Unspecified</description>
          <headerStructName>UICR_USER</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x200</addressOffset>
          <cluster>
            <name>ROT</name>
            <description>Assets installed to establish initial Root of Trust in the device.</description>
            <headerStructName>UICR_USER_ROT</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>4</dim>
              <dimIncrement>0x02C</dimIncrement>
              <name>PUBKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>UICR_USER_ROT_PUBKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>4</dim>
              <dimIncrement>0x02C</dimIncrement>
              <name>AUTHOPKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>UICR_USER_ROT_AUTHOPKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x0B0</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
        <register>
          <dim>0x140</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OTP[%s]</name>
          <description>Description collection: One time programmable memory</description>
          <addressOffset>0x500</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OTP</name>
              <description>OTP word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
