NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lc10a/nrf54lc10a_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_SICR_S</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FFE000</baseAddress>
      <headerStructName>SICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ICACHEDATA_S</name>
      <description>CACHEDATA</description>
      <baseAddress>0x02F00000</baseAddress>
      <headerStructName>CACHEDATA</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CACHEDATA</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>128</dim>
          <dimIncrement>0x040</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>CACHEDATA_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>CACHEDATA_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <dim>4</dim>
              <dimIncrement>0x008</dimIncrement>
              <name>DU[%s]</name>
              <description>Unspecified</description>
              <headerStructName>CACHEDATA_SET_WAY_DU</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DATA[%s]</name>
                <description>Description collection: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o].</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>Data</name>
                    <description>Data</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <access>read-only</access>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>ICACHEINFO_S</name>
      <description>CACHEINFO</description>
      <baseAddress>0x02F10000</baseAddress>
      <headerStructName>CACHEINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CACHEINFO</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>128</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>CACHEINFO_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x004</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>CACHEINFO_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <register>
              <name>INFO</name>
              <description>Description cluster: Cache information for SET[n], WAY[o].</description>
              <addressOffset>0x0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAG</name>
                  <description>Cache tag.</description>
                  <lsb>0</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DUV_0</name>
                  <description>Data unit valid info.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_1</name>
                  <description>Data unit valid info.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_2</name>
                  <description>Data unit valid info.</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_3</name>
                  <description>Data unit valid info.</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>V</name>
                  <description>Line valid bit.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid cache line</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid cache line</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MRU</name>
                  <description>Most recently used way.</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Way0</name>
                      <description>Way0 was most recently used</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Way1</name>
                      <description>Way1 was most recently used</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
