NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lc10a/nrf54lc10a_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM20_NS">
      <name>GLOBAL_SPIM20_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS20_NS">
      <name>GLOBAL_SPIS20_S</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM20_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS20_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE20_NS">
      <name>GLOBAL_UARTE20_S</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM20_NS">
      <name>GLOBAL_SPIM21_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS20_NS">
      <name>GLOBAL_SPIS21_NS</name>
      <description>SPI Slave 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM21_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS21_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE20_NS">
      <name>GLOBAL_UARTE21_NS</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM20_NS">
      <name>GLOBAL_SPIM21_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS20_NS">
      <name>GLOBAL_SPIS21_S</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM21_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS21_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE20_NS">
      <name>GLOBAL_UARTE21_S</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU00_NS">
      <name>GLOBAL_EGU20_NS</name>
      <description>Event generator unit 4</description>
      <baseAddress>0x400C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU00_NS">
      <name>GLOBAL_EGU20_S</name>
      <description>Event generator unit 5</description>
      <baseAddress>0x500C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
